In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels=['a','b','c']
mydata=[10,20,30]
arr=np.array(mydata)
d={'a':10,'b':20,'ç':30}

In [7]:
pd.Series(mydata,labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(d)

a    10
b    20
ç    30
dtype: int64

In [12]:
ser1=pd.Series([1,2,3,4],['india','úsa','ussr','canada'])

In [13]:
ser1

india     1
úsa       2
ussr      3
canada    4
dtype: int64

In [14]:
ser2=pd.Series([1,2,3,4],['india','úsa','malaysia','canada'])
ser2

india       1
úsa         2
malaysia    3
canada      4
dtype: int64

In [17]:
ser1 + ser2

canada      8.0
india       2.0
malaysia    NaN
ussr        NaN
úsa         4.0
dtype: float64

In [18]:
ser2

india       1
úsa         2
malaysia    3
canada      4
dtype: int64

In [19]:
from numpy.random import randn

In [20]:
np.random.seed(101)

In [21]:
df=pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [22]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [26]:
 df['x']

a    0.628133
b   -0.319318
c    0.740122
d   -0.758872
e    1.978757
Name: x, dtype: float64

In [30]:
df['new']=df['w']+df['y']

In [32]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.614819
b  0.651118 -0.319318 -0.848077  0.605965 -0.196959
c -2.018168  0.740122  0.528813 -0.589001 -1.489355
d  0.188695 -0.758872 -0.933237  0.955057 -0.744542
e  0.190794  1.978757  2.605967  0.683509  2.796762

In [37]:
df.drop('new',axis=1,inplace=True)

In [38]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [39]:
df.drop('e')

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

In [40]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [41]:
df.loc['a']

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [44]:
df.loc[['a','b'],['x','y']]

          x         y
a  0.628133  0.907969
b -0.319318 -0.848077

In [46]:
df[df>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [47]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [49]:
df[df['w']>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [50]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [51]:
df[df['x']<0]

          w         x         y         z
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057

In [53]:
df[(df['w']>0) & (df['y']>0)]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
e  0.190794  1.978757  2.605967  0.683509

In [54]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [55]:
  df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [62]:
xxx="mom papa dad mummy dada".split()

In [63]:
xxx

['mom', 'papa', 'dad', 'mummy', 'dada']

In [64]:
df['xxx']= xxx

In [65]:
df

          w         x         y         z    xxx
a  2.706850  0.628133  0.907969  0.503826    mom
b  0.651118 -0.319318 -0.848077  0.605965   papa
c -2.018168  0.740122  0.528813 -0.589001    dad
d  0.188695 -0.758872 -0.933237  0.955057  mummy
e  0.190794  1.978757  2.605967  0.683509   dada

In [67]:
  df.set_index('xxx')

              w         x         y         z
xxx
mom    2.706850  0.628133  0.907969  0.503826
papa   0.651118 -0.319318 -0.848077  0.605965
dad   -2.018168  0.740122  0.528813 -0.589001
mummy  0.188695 -0.758872 -0.933237  0.955057
dada   0.190794  1.978757  2.605967  0.683509

In [68]:
df

          w         x         y         z    xxx
a  2.706850  0.628133  0.907969  0.503826    mom
b  0.651118 -0.319318 -0.848077  0.605965   papa
c -2.018168  0.740122  0.528813 -0.589001    dad
d  0.188695 -0.758872 -0.933237  0.955057  mummy
e  0.190794  1.978757  2.605967  0.683509   dada

In [70]:
outside=['g1','g1','g1','g2','g2','g2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [71]:
 hier_index

MultiIndex(levels=[['g1', 'g2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [74]:
df=pd.DataFrame(randn(6,2),hier_index,['a','b'])

In [75]:
df

             a         b
g1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259
g2 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

In [76]:
 df.loc['g1']

          a         b
1  1.025984 -0.156598
2 -0.031579  0.649826
3  2.154846 -0.610259

In [78]:
df.index.names=['groups','numbers']

In [79]:
df

                       a         b
groups numbers
g1     1        1.025984 -0.156598
       2       -0.031579  0.649826
       3        2.154846 -0.610259
g2     1       -0.755325 -0.346419
       2        0.147027 -0.479448
       3        0.558769  1.024810

In [80]:
df.loc['g2'].loc[2]['b']

-0.47944803904109595

In [81]:
df.xs('g1')

                a         b
numbers
1        1.025984 -0.156598
2       -0.031579  0.649826
3        2.154846 -0.610259

In [82]:
df.xs(1,level='numbers')

               a         b
groups
g1      1.025984 -0.156598
g2     -0.755325 -0.346419

In [1]:
  import numpy as np

In [2]:
import pandas as pd

In [4]:
d={'a':[1,2,np.nan],'b':[5,np.nan,np.nan],'c':[1,2,3]}

In [9]:
df=pd.DataFrame(d)

In [10]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [18]:
df.dropna()

     a    b  c
0  1.0  5.0  1

In [20]:
df.fillna(value='GOT')

     a    b  c
0    1    5  1
1    2  GOT  2
2  GOT  GOT  3

In [21]:
data={'company':['goog','goog','msft','msft','fb','fb'],
     'person':['sam','charlie','amy','vannessa','carl','sarah'],
     'sales':[200,120,340,124,243,350]}

In [22]:
df=pd.DataFrame(data)

In [23]:
df

  company    person  sales
0    goog       sam    200
1    goog   charlie    120
2    msft       amy    340
3    msft  vannessa    124
4      fb      carl    243
5      fb     sarah    350

In [25]:
m=df.groupby('company')

In [28]:
m

In [29]:
m.mean()

         sales
company
fb       296.5
goog     160.0
msft     232.0

In [30]:
m.std()

              sales
company
fb        75.660426
goog      56.568542
msft     152.735065

In [31]:
 m.count()

         person  sales
company
fb            2      2
goog          2      2
msft          2      2

In [32]:
m.sum()

         sales
company
fb         593
goog       320
msft       464

In [35]:
m.sum().loc['fb']

sales    593
Name: fb, dtype: int64

In [36]:
n=df.groupby('sales')

In [37]:
n

In [38]:
n.sum()

      company    person
sales
120      goog   charlie
124      msft  vannessa
200      goog       sam
243        fb      carl
340      msft       amy
350        fb     sarah

In [39]:
n.count()

       company  person
sales
120          1       1
124          1       1
200          1       1
243          1       1
340          1       1
350          1       1

In [40]:
n.min()

      company    person
sales
120      goog   charlie
124      msft  vannessa
200      goog       sam
243        fb      carl
340      msft       amy
350        fb     sarah

In [41]:
m.describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
fb        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
msft      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [42]:
m.describe().transpose()['goog']

sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: goog, dtype: float64

In [44]:
df1=pd.DataFrame({'a':['a0','a1','a2','a3'],
                  'b':['b0','b1','b2','b3'],
                  'c':['c0','c1','c2','c3'],
                  'd':['d0','d1','d2','d3']},
                  index=[0,1,2,3])
df2=pd.DataFrame({'a':['a4','a5','a6','a7'],
                  'b':['b4','b5','b6','b7'],
                  'c':['c4','c5','c6','c7'],
                  'd':['d4','d5','d6','d7']},
                  index=[4,5,6,7])
df3=pd.DataFrame({'a':['a8','a9','a10','a11'],
                  'b':['b8','b9','b10','b11'],
                  'c':['c8','c9','c10','c11'],
                  'd':['d8','d9','d10','d11']},
                  index=[8,9,10,11])

In [45]:
df1

    a   b   c   d
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [47]:
df2

    a   b   c   d
4  a4  b4  c4  d4
5  a5  b5  c5  d5
6  a6  b6  c6  d6
7  a7  b7  c7  d7

In [48]:
df3

      a    b    c    d
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [49]:
pd.concat([df1,df2,df3])

      a    b    c    d
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [50]:
pd.concat([df1,df2,df3],axis=1)

      a    b    c    d    a    b    c    d    a    b    c    d
0    a0   b0   c0   d0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    a1   b1   c1   d1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    a2   b2   c2   d2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    a3   b3   c3   d3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   a4   b4   c4   d4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   a5   b5   c5   d5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   a6   b6   c6   d6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   a7   b7   c7   d7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   a8   b8   c8   d8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   a9   b9   c9   d9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  a10  b10  c10  d10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  a11  b11  c11  d11

In [51]:
left=pd.DataFrame({'key':['k0','k1','k2','k3'],
                   'a':['a0','a1','a2','a3'],
                   'b':['b0','b1','b2','b3']})
right=pd.DataFrame({'key':['k0','k1','k2','k3'],
                   'c':['c0','c1','c2','c3'],
                   'd':['d0','d1','d2','d3']})

In [52]:
left

  key   a   b
0  k0  a0  b0
1  k1  a1  b1
2  k2  a2  b2
3  k3  a3  b3

In [53]:
right

  key   c   d
0  k0  c0  d0
1  k1  c1  d1
2  k2  c2  d2
3  k3  c3  d3

In [54]:
pd.merge(left,right,how='inner',on='key')

  key   a   b   c   d
0  k0  a0  b0  c0  d0
1  k1  a1  b1  c1  d1
2  k2  a2  b2  c2  d2
3  k3  a3  b3  c3  d3

In [57]:
left=pd.DataFrame({'a':['a0','a1','a2'],
                   'b':['b0','b1','b2']},
                   index=['k0','k1','k2'])
right=pd.DataFrame({'c':['c0','c2','c3'],
                   'd':['d0','d2','d3']},
                   index=['k0','k2','k3'])

In [58]:
left

     a   b
k0  a0  b0
k1  a1  b1
k2  a2  b2

In [59]:
right

     c   d
k0  c0  d0
k2  c2  d2
k3  c3  d3

In [60]:
left.join(right)

     a   b    c    d
k0  a0  b0   c0   d0
k1  a1  b1  NaN  NaN
k2  a2  b2   c2   d2

In [61]:
right.join(left)

     c   d    a    b
k0  c0  d0   a0   b0
k2  c2  d2   a2   b2
k3  c3  d3  NaN  NaN

In [64]:
 right.join(left,how='outer')

      c    d    a    b
k0   c0   d0   a0   b0
k1  NaN  NaN   a1   b1
k2   c2   d2   a2   b2
k3   c3   d3  NaN  NaN

In [65]:
df=pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,555,666,444],
                 'col3':['abc','def','ghi','xyz']})

In [66]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [67]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [68]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [69]:
df['col2'].nunique()

3

In [70]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [71]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [72]:
df[(df['col1']>2)&(df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [73]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [74]:
 def times(x):
        return x*2

In [75]:
df['col1'].apply(times)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [78]:
df['col3'].apply(times)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [80]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [81]:
 df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [83]:
 df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [85]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [86]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [87]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [88]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [90]:
df=pd.DataFrame({'a':['foo','foo','foo','bar','bar','bar'],
                 'b':['one','one','two','two','one','one'],
                 'c':['x','y','x','y','x','y'],
                 'd':[1,3,2,5,4,1]})

In [91]:
df

     a    b  c  d
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [92]:
df.pivot_table('d',index=['a','b'],columns=['c'])

c          x    y
a   b
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [93]:
df.pivot_table('d',index=['a','b'],columns=['b'])

b        one  two
a   b
bar one  2.5  NaN
    two  NaN  5.0
foo one  2.0  NaN
    two  NaN  2.0

In [96]:
df.pivot_table('d',index=['a','b'],columns=['a'])

a        bar  foo
a   b
bar one  2.5  NaN
    two  5.0  NaN
foo one  NaN  2.0
    two  NaN  2.0